Repository: Keriw01/FitForge
Catalog: lib/l10n/intl_*.arb
Languages: pl

# loginPageTitle
source: Login
pl: Logowanie

# loginButton
source: Login
pl: Zaloguj

# dontHaveAccount
source: Don`t have an Account ?
pl: Nie masz konta ?

source: Sign Up
pl: Zarejestruj się

# registerPageTitle
source: Register
pl: Rejestracja

# signUpButton
source: Register
pl: Zarejestruj

# alreadyHaveAccount
source: Already have an Account ?
pl: Masz już konto ?

source: Sign In
pl: Zaloguj się

source: OR
pl: LUB

source: Enter valid e-mail
pl: Wprowadź poprawny adres e-mail

source: Enter e-mail
pl: Wpisz swój e-mail

# requiredPassword
source: Password is required
pl: Hasło jest wymagane

# enterValidPassword
source: Password must contains minimum 8 characters
pl: Hasło musi mieć co najmniej 8 znaków

# enterPassword
source: Enter your password
pl: Wpisz swoje hasło

# defaultError
source: Error
pl: Błąd

# networkRequestFailed
source: No internet connection
pl: Brak połączenia internetowego

# badAuthorization
source: Invalid email or password
pl: Nie poprawny email lub hasło

source: User already exist
pl: Użytkownik już istnieje

source: User already LogIn
pl: Użytkownik już zalogowany

# googleLoginCanceled
source: Login with Google canceled
pl: Anulowano logowanie przez Google

# gitHubLoginCanceled
source: Login with GitHub canceled
pl: Anulowano logowanie przez GitHub

source: Invalid Email Format
pl: Nie prawidłowy adres emial

# inputEmpty
source: Empty field
pl: Puste pole

# notValidEmail
source: Incorrect email address
pl: Niepoprawny adres email

# weakPassword
source: The password must be at least 8 characters long and contain one letter, a number and a special character
pl: Hasło musi mieć co najmniej 8 znaków, zawierać jedną literę, cyfrę oraz znak specjalny

# shortPassword
source: The password is too short, at least 8 characters
pl: Hasło jest za krótkie minimum 8 znaków

# workoutsLabel
source: Workout
pl: Plany

# exercisesLabel
source: Exercises
pl: Ćwiczenia

# statisticsLabel
source: Progress
pl: Historia

# scanQrLabel
source: Scan QR
pl: Skanuj QR

source: Logout
pl: Wyloguj

# settingsTitle
source: Settings
pl: Ustawienia

source: Basic information
pl: Podstawowe informacje

# usernameLabel
source: Username
pl: Nazwa użytkownika

# genderLabel
source: Gender
pl: Płeć

# birthDateLabel
source: Birth Date
pl: Data urodzenia

# basicGymLocationLabel
source: Basic Gym Location
pl: Lokalizacja siłowni

# currentWorkoutLevelLabel
source: Current Workout Level
pl: Poziom zaawansowania

# topGoalLabel
source: Top Goal
pl: Cel

source: Profile View Mode
pl: Tryb wyświetlania profilu

source: Other
pl: Inne

source: Unit System
pl: Jednostki

source: Default Reps
pl: Ilość powtórzeń

# defaultsSets
source: Default Sets
pl: Ilość serii

source: Connect with Google Fit
pl: Połącz się z Google Fit

# firestoreException
source: Cloud Database Error
pl: Błąd Cloud Database

source: no data
pl: brak danych

# editUsernameLabel
source: Edit Username
pl: Edytuj nazwę użytkownkia

source: Enter New Username
pl: Wprowadź nową nazwę użytkownika

source: Cancel
pl: Anuluj

source: Save
pl: Zapisz

# editGenderLabel
source: Choose Gender
pl: Wybierz płeć

source: Male
pl: Mężczyzna

source: Female
pl: Kobieta

source: Enter birth date
pl: Wprowadź datę urodzin

# editCurrentWorkoutLevel
source: Choose your workout level
pl: Wybierz poziom zaawansowania

# begginer
source: Beginner
pl: Początkujący

source: Intermediate
pl: Średnio-zaawansowany

source: Advanced
pl: Zaawansowany

# editTopGoal
source: Choose your top goal
pl: Wybierz swój cel treningu

source: Maintaining
pl: Ogólny

# maintainingDescription
source: Staying healthy and having good cardiovascular health
pl: Bądź zdrowy i dbaj o zdrowie układu krążenia

source: Bulking
pl: Zbudować masę

# bulkingDescription
source: Focus on gaining muscle size and building strength
pl: Skoncentruj się na zwiększaniu masy mięśniowej i budowaniu siły

source: Cutting
pl: Schudnąć

# cuttingDescription
source: Focus on losing body fat or lose weight in general
pl: Skoncentruj się na utracie tkanki tłuszczowej lub ogólnie schudnij

# editUnitSystem
source: Choose unit system
pl: Wybierz rodzaj jednostek

# editDefaultSets
source: Set default sets
pl: Ustaw domyślną ilość serii

# editDefaultReps
source: Set default reps
pl: Ustaw domyślną ilość powtórzeń

source: Connect
pl: Połącz

# bodyPartsPageTitle
source: Body Parts
pl: Partie ciała

source: Chest
pl: Klatka piersiowa

source: Shoulders
pl: Barki

source: Core
pl: Brzuch

source: Back
pl: Plecy

source: Forearms
pl: Przedramie

source: Upper Legs
pl: Górne partie nóg

source: Glutes
pl: Pośladki

source: Lower Legs
pl: Dolne partie nóg

source: Show All
pl: Pokaż wszystkie

# exercisesPageTitle
source: Exercises
pl: Ćwiczenia

# exerciseDetailPageTitle
source: Exercise Detail
pl: Szczegóły ćwiczenia

source: Target Muscle Group
pl: Grupa docelowa mięśni

source: Available Equipment
pl: Dostępny ekwipunek

source: Description
pl: Opis

source: Add Exercise To Your Plan
pl: Dodaj ćwiczenia do planu

source: Exit
pl: Wyjście

# scanQrInfo
source: Scan QR code to get information and video instruction about this machine/exercise.
pl: Zeskanuj kod QR, aby uzyskać informacje i instrukcje wideo dotyczące tej maszyny/ćwiczenia.

# scanQrFirstHeader
source: Scan, Practice, Achieve Goals!
pl: Skanuj, Ćwicz, Osiągaj Cele!

# scanQrFirstDescription
source: Scanning QR codes in our gym is a modern solution that will make your workouts more effective and enjoyable. Simply scan the QR code located at each machine or on the billboard for static exercises to get a full description of the exercise.
pl: Skanowanie kodów QR w naszej siłowni to nowoczesne rozwiązanie, które sprawi, że Twoje treningi staną się bardziej efektywne i przyjemne. Wystarczy zeskanować kod QR znajdujący się przy każdej maszynie lub na bilbordzie przy ćwiczeniach statycznych, aby uzyskać pełny opis ćwiczenia.

# scanQrSecondHeader
source: What will you find after scanning?
pl: Co znajdziesz po zeskanowaniu?

# scanQrFirstPoint
source: A detailed description of the exercise being performed, which will help you perform it correctly:
pl: Szczegółowy opis wykonywanego ćwiczenia, który pomoże Ci prawidłowo je wykonać:

# scanQrSecondPoint
source: Clear, step-by-step instructions to help you maintain correct form and technique.
pl: Jasne i zrozumiałe instrukcje krok po kroku, które pomogą Ci utrzymać prawidłową formę i technikę.

# scanQrThirdPoint
source: Information on which body parts a given exercise works, so you can effectively plan your training sessions.
pl: Informacja, na jakie partie ciała działa dane ćwiczenie, abyś mógł skutecznie planować swoje sesje treningowe.

# scanQrFourPoint
source: Information about any necessary equipment or machines required to perform the exercise, if needed.
pl: Informacje na temat niezbędnego sprzętu lub maszyn wymaganych do wykonania ćwiczenia, jeśli są potrzebne.

# scanQrThirdHeader
source: Our QR codes are your key source of gym training knowledge. They will help you save time, avoid mistakes and make the most of every minute spent training. Scan the code, learn the exercise and achieve your goals faster!
pl: Nasze kody QR to Twoje kluczowe źródło wiedzy na temat treningów w siłowni. Dzięki nim zaoszczędzisz czas, unikniesz błędów i maksymalnie wykorzystasz każdą minutę spędzoną na treningu. Zeskanuj kod, poznaj ćwiczenie i osiągnij swoje cele szybciej!

source: Close
pl: Zamknij

# backButton
source: Back
pl: Cofnij

# invalidBarcode
source: The QR code is invalid or illegible. Please try scanning again.
pl: Kod QR jest nieprawidłowy lub nieczytelny. Spróbuj zeskanować ponownie.

# qrCodeNotFound
source: QR code not found. Make sure you are scanning the correct code.
pl: Kod QR nie został znaleziony. Upewnij się, że skanujesz poprawny kod.

# cameraAccessDenied
source: Camera permissions were denied.
pl: Uprawnienia kamery zostały odmówione.

# cameraAccessLimited
source: Camera permissions have been restricted.
pl: Uprawnienia kamery zostały ograniczone.

# myPlansHeader
source: My plans
pl: Moje plany

# currentPlanHeader
source: Current
pl: Bieżący

# emptyPlans
source: You don`t have any training plan created. Create one using the button at the bottom.
pl: Nie masz utworzonego żadnego planu treningowego. Utwórz go poprzez przycisk na dole.

# emptyCurrentPlan
source: You don`t have a training plan selected. Select one in the section
pl: Nie masz wybranego planu treningowego. Wybierz go w sekcji

# createYourOwnWorkoutPlanButton
source: Create Your Own Workout Plan
pl: Stwórz swój plan treningowy

# createWorkoutPlanHeader
source: Create Plan
pl: Stwórz plan

source: Confirm
pl: Potwierdź

source: Plan Name
pl: Nazwa planu

source: Select Plan Type
pl: Wybierz typ planu

source: Select Difficulty Level
pl: Wybierz poziom zaawansowania

source: Select Number of Days
pl: Wybierz ilość dni planu

source: Plan Description
pl: Opis planu

source: Plan name required
pl: Nazwa planu wymagana

source: Plan description required
pl: Opis planu wymagany

source: Set
pl: Ustaw

source: Last activity:
pl: Ostatnia aktywność:

source: Day(s)
pl: Dni

source: Active
pl: Aktywny

source: Edit Plan
pl: Edycja planu

source: Discard
pl: Odrzuć

source: Edit
pl: Edycja

source: Delete
pl: Usuń

source: Confirm Delete
pl: Potwierdź usunięcie

source: Plan is empty.
pl: Plan jest pusty.

# addDayInfo
source: Please add day to this routine.
pl: Proszę dodaj dzień ćwiczeniowy.

# addDay
source: Add a day
pl: Dodaj dzień

source: Last performed:
pl: Ostatnio wykonany:

# renameDay
source: Rename
pl: Zmień nazwę
